# Lab 17 - 1828258 Pranav Shekhar

## 1)	.Create a class with a method that prints "This is parent class" and its subclass with another method that prints "This is child class". 

#### Now, create an object for each of the class and call
#### 1 - method of parent class by object of parent class
#### 2 - method of child class by object of child class
#### 3 - method of parent class by object of child class.

In [1]:
class Parent:  
    def funParent(self):  
        print("This is parent class")   
class Child(Parent):  
    def funChild(self):  
        print("This is child class")  
obj = Parent()
obj.funParent() 

obj2 = Child()
obj2.funChild()

obj2.funParent()

This is parent class
This is child class
This is parent class

## 2)	Write a Python program to find the average of highest 3 values in a dictionary.

In [2]:
dictionary={'Pranav': 20, 'Praddyum': 29, 'Neelanjan': 30, 'Chandan': 30, 'Arnab': 28, 'Ayanava': 27 }

print(dictionary)

values=[x for x in dictionary.values()]

for i in range(0, len(values)):
    for j in range(i, len(values)):
        if values[i]<values[j]:
            temp=values[i]
            values[i]=values[j]
            values[j]=temp

average=(values[0]+values[1]+values[2])/3

print("Average of highest 3 values = ", average)

{'Pranav': 20, 'Praddyum': 29, 'Neelanjan': 30, 'Chandan': 30, 'Arnab': 28, 'Ayanava': 27}
Average of highest 3 values =  29.666666666666668

## 3) 	WAP TO FIND THE AVERAGE, MODE, STANDARD DEVIATION , VARIANCE OF ARRAY ELEMENT.

In [15]:
from scipy import stats
import numpy as np

a=np.arange(1,20)
print(np.mean(a)) # Mean= sum / n,  Median = Middle if n is odd and average of middle two elements if n is evem
print(np.std(a))  #  Square root of variance
print(np.var(a))  # Summation of Squared differences from  mean divided by n

b=[1,2,3,4,5,4,1,1]

print(stats.mode(b)[0][0]) # Mode = Most Frequent element in array

10.0
5.477225575051661
30.0
1

## 4)	WAP TO PERFORM RIGHT JOIN AND INNER JOIN.

In [13]:
import pandas as pd

student=pd.DataFrame({
    'Roll':[101,102,103,104,105,106,107],
    'Name':['Pranav','Neelanjan','Ashish','Chandan','Praddyum','Ayanava','Arnab'],
    'Subject':['OS','CN','DBMS','CC','DMS','BMS','Electronics'],
    'Code':[299,135,299,149,145,110,799],
    'City':['Delhi','Mumbai','Chennai','Kolkata','Delhi','Chennai','Bengalore']
})

teacher=pd.DataFrame({
    'id':[1,2,3,4,5,6,7],
    'name':['Jatin','Debdulal','Sri Acharya','Shruti','Vibha','Nandalal','Samuel'],
    'age':[20,25,15,10,30,65,35],
    'Code':[299,135,299,149,145,110,799],
    'City':['Mumbai','Delhi','Bangalore','Chennai','Chennai','Delhi','Kolkata']
})

pd.merge(student,teacher,on='Code',how='right')

,Roll,Name,Subject,Code,City_x,id,name,age,City_y
0,101,Pranav,OS,299,Delhi,1,Jatin,20,Mumbai
1,103,Ashish,DBMS,299,Chennai,1,Jatin,20,Mumbai
2,101,Pranav,OS,299,Delhi,3,Sri Acharya,15,Bangalore
3,103,Ashish,DBMS,299,Chennai,3,Sri Acharya,15,Bangalore
4,102,Neelanjan,CN,135,Mumbai,2,Debdulal,25,Delhi
5,104,Chandan,CC,149,Kolkata,4,Shruti,10,Chennai
6,105,Praddyum,DMS,145,Delhi,5,Vibha,30,Chennai
7,106,Ayanava,BMS,110,Chennai,6,Nandalal,65,Delhi
8,107,Arnab,Electronics,799,Bengalore,7,Samuel,35,Kolkata

In [14]:
pd.merge(student,teacher,on='Code',how='inner')

,Roll,Name,Subject,Code,City_x,id,name,age,City_y
0,101,Pranav,OS,299,Delhi,1,Jatin,20,Mumbai
1,101,Pranav,OS,299,Delhi,3,Sri Acharya,15,Bangalore
2,103,Ashish,DBMS,299,Chennai,1,Jatin,20,Mumbai
3,103,Ashish,DBMS,299,Chennai,3,Sri Acharya,15,Bangalore
4,102,Neelanjan,CN,135,Mumbai,2,Debdulal,25,Delhi
5,104,Chandan,CC,149,Kolkata,4,Shruti,10,Chennai
6,105,Praddyum,DMS,145,Delhi,5,Vibha,30,Chennai
7,106,Ayanava,BMS,110,Chennai,6,Nandalal,65,Delhi
8,107,Arnab,Electronics,799,Bengalore,7,Samuel,35,Kolkata

## 5. Write a Python program to create a dictionary of keys p, q, and r where each key has as value a list from 101-120, 201-220, and 301-320 respectively. Display the seventh (both from beginning and end)value of each key from the dictionary.

In [11]:
dictionary4={'p': [x for x in range(101,121)], 'q': [x for x in range(201,221)], 'r': [x for x in range(301,321)]}

for i in dictionary4.keys():
   print("For Key :-", i)
   print("Seventh value from beginning :- ",dictionary4[i][6])
   print("Seventh value from end :- ", dictionary4[i][-7])

For Key :- p
Seventh value from beginning :-  107
Seventh value from end :-  114
For Key :- q
Seventh value from beginning :-  207
Seventh value from end :-  214
For Key :- r
Seventh value from beginning :-  307
Seventh value from end :-  314

In [1]:
a = input(" Enter character")

print(a*5)

aaaaa